modules/user/models/SignupForm.php

    public function signup()
    {
        if ($this->validate()) {
            $user = new User();
            $user->username = $this->username;
            $user->email = $this->email;
            $user->setPassword($this->password);
            $user->status = User::STATUS_WAIT;
            $user->generateAuthKey();
            $user->generateEmailConfirmToken();
            if ($user->save()) {
---
INSERT INTO `keys_user` (`username`, `email`, `password_hash`, `status`, `auth_key`, `email_confirm_token`, `created_at`, `updated_at`) VALUES ('Svid3', 'Svid_off3@mail.ru', '$2y$13$9hEsA2xuTwhE8iK/qsO9fe/i.J8S1Y5qBAsmGyKsiW68TR2JGh.de', 2, 'p0LGE36gb2D8TQktSr-57Zo6CgP9j97Q', 'ja2mRahDUSf16yQ9hcCKi8pU_SvXtyeZ', 1437243483, 1437243483)