modules/user/models/User.php

SELECT * FROM `keys_user` WHERE (`id`=1) AND (`status`=1)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `keys_user` WHERE `username`='svid'
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);